In [1]:
import numpy as np 
import pandas as pd 
import matplotlib.pyplot as plt

## Default DataFrames

In [2]:
df=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])

In [3]:
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [4]:
# the above is the custom dataframen with out any columns and indexes

In [5]:
df1=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],columns=['A','B','C'],index=['x','y','z'])

In [6]:
df1

   A  B  C
x  1  2  3
y  4  5  6
z  7  8  9

In [7]:
# basic properties

In [8]:
df1.shape

(3, 3)

In [9]:
df1.ndim

2

In [11]:
df1.size

9

In [12]:
# to print the top 5 elements

In [13]:
df1.head()

   A  B  C
x  1  2  3
y  4  5  6
z  7  8  9

In [14]:
df1.head(1)

   A  B  C
x  1  2  3

In [15]:
df1.tail()

   A  B  C
x  1  2  3
y  4  5  6
z  7  8  9

In [16]:
df1.tail(1)

   A  B  C
z  7  8  9

In [17]:
# to retrive the columns of the dataframe

In [18]:
df1.columns

Index(['A', 'B', 'C'], dtype='object')

In [19]:
# convert to the list
list(df1.columns)

['A', 'B', 'C']

In [20]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, x to z
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
dtypes: int64(3)
memory usage: 204.0+ bytes

In [21]:
df1.describe()

         A    B    C
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [23]:
# to print all the unique elements in an data froma

df1.nunique()
# nunique gives us the number if n=unique elements in an elements

A    3
B    3
C    3
dtype: int64

In [24]:
df1.A.unique()

array([1, 4, 7])

In [25]:
df1.B.unique()

array([2, 5, 8])

In [32]:
for i in list(df1.columns):
    print(df1[i].unique)
    print()

<bound method Series.unique of x    1
y    4
z    7
Name: A, dtype: int64>

<bound method Series.unique of x    2
y    5
z    8
Name: B, dtype: int64>

<bound method Series.unique of x    3
y    6
z    9
Name: C, dtype: int64>

## Loading of the DataFrames from external files

In [33]:
coffee=pd.read_csv('/Users/chowdaryadithyasaividivada/Downloads/coffee.csv')

In [34]:
coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [35]:
# different formats of the loading of the data is

In [37]:
#results=pd.read_parquet('/Users/chowdaryadithyasaividivada/Downloads/results.parquet')
#this not run without dependency

In [38]:
bios=pd.read_csv('/Users/chowdaryadithyasaividivada/Downloads/bios.csv')

In [39]:
bios

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25
...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20

In [40]:
bios.shape

(145500, 10)

In [41]:
bios.ndim

2

In [42]:
bios.size

1455000

In [43]:
olympicsdata=pd.read_excel('/Users/chowdaryadithyasaividivada/Downloads/olympics-data.xlsx')

In [45]:
olympicsdata

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25
...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20

In [46]:
olympicsdata.shape

(145500, 10)

In [48]:
olympicsdata.ndim
olympicsdata.size

1455000

In [49]:
print(coffee)

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [50]:
display(coffee)

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [51]:
# to print we us print(coffee)  to print as an table we use the display option

In [52]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [53]:
coffee.tail()

         Day Coffee Type  Units Sold
9     Friday       Latte          35
10  Saturday    Espresso          45
11  Saturday       Latte          35
12    Sunday    Espresso          45
13    Sunday       Latte          35

In [54]:
coffee.sample(6)

          Day Coffee Type  Units Sold
12     Sunday    Espresso          45
4   Wednesday    Espresso          35
8      Friday    Espresso          45
6    Thursday    Espresso          40
11   Saturday       Latte          35
7    Thursday       Latte          30

In [55]:
# coffee.sample(n) will return the n random rows form the data frame

## Retriving of the data

In [56]:
coffee.loc[0]

Day              Monday
Coffee Type    Espresso
Units Sold           25
Name: 0, dtype: object

In [57]:
# the above give the nth row

In [58]:
display(coffee)

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [59]:
# play around with the rows and columns

In [60]:
coffee.loc[[0,5,2]]

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
5  Wednesday       Latte          25
2    Tuesday    Espresso          30

In [61]:
coffee.loc[4:12,['Day']]

          Day
4   Wednesday
5   Wednesday
6    Thursday
7    Thursday
8      Friday
9      Friday
10   Saturday
11   Saturday
12     Sunday

In [62]:
# we can select the columsn as shown above

In [63]:
coffee.loc[0:5,['Day','Coffee Type','Units Sold']]

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35
5  Wednesday       Latte          25

In [64]:
# retriving through the numeric indexes rather than assigned

In [67]:
coffee.iloc[3:10,[i for i in range(3)]]

         Day Coffee Type  Units Sold
3    Tuesday       Latte          20
4  Wednesday    Espresso          35
5  Wednesday       Latte          25
6   Thursday    Espresso          40
7   Thursday       Latte          30
8     Friday    Espresso          45
9     Friday       Latte          35

In [68]:
coffee.index

RangeIndex(start=0, stop=14, step=1)

In [69]:
print(coffee.index)

RangeIndex(start=0, stop=14, step=1)

In [70]:
coffee.index=coffee.Day

In [71]:
display(coffee)

                 Day Coffee Type  Units Sold
Day
Monday        Monday    Espresso          25
Monday        Monday       Latte          15
Tuesday      Tuesday    Espresso          30
Tuesday      Tuesday       Latte          20
Wednesday  Wednesday    Espresso          35
Wednesday  Wednesday       Latte          25
Thursday    Thursday    Espresso          40
Thursday    Thursday       Latte          30
Friday        Friday    Espresso          45
Friday        Friday       Latte          35
Saturday    Saturday    Espresso          45
Saturday    Saturday       Latte          35
Sunday        Sunday    Espresso          45
Sunday        Sunday       Latte          35

In [72]:
coffee.loc['Wednesday']

                 Day Coffee Type  Units Sold
Day
Wednesday  Wednesday    Espresso          35
Wednesday  Wednesday       Latte          25

In [74]:
coffee.loc['Monday':'Wednesday']

                 Day Coffee Type  Units Sold
Day
Monday        Monday    Espresso          25
Monday        Monday       Latte          15
Tuesday      Tuesday    Espresso          30
Tuesday      Tuesday       Latte          20
Wednesday  Wednesday    Espresso          35
Wednesday  Wednesday       Latte          25

In [75]:
coffee.loc['Monday':'Wednesday',['units']]=10

In [76]:
coffee

                 Day Coffee Type  Units Sold  units
Day
Monday        Monday    Espresso          25   10.0
Monday        Monday       Latte          15   10.0
Tuesday      Tuesday    Espresso          30   10.0
Tuesday      Tuesday       Latte          20   10.0
Wednesday  Wednesday    Espresso          35   10.0
Wednesday  Wednesday       Latte          25   10.0
Thursday    Thursday    Espresso          40    NaN
Thursday    Thursday       Latte          30    NaN
Friday        Friday    Espresso          45    NaN
Friday        Friday       Latte          35    NaN
Saturday    Saturday    Espresso          45    NaN
Saturday    Saturday       Latte          35    NaN
Sunday        Sunday    Espresso          45    NaN
Sunday        Sunday       Latte          35    NaN

In [77]:
coffee.Day

Day
Monday          Monday
Monday          Monday
Tuesday        Tuesday
Tuesday        Tuesday
Wednesday    Wednesday
Wednesday    Wednesday
Thursday      Thursday
Thursday      Thursday
Friday          Friday
Friday          Friday
Saturday      Saturday
Saturday      Saturday
Sunday          Sunday
Sunday          Sunday
Name: Day, dtype: object

In [78]:
# to position the elements

In [80]:
coffee

                 Day Coffee Type  Units Sold  units
Day
Monday        Monday    Espresso          25   10.0
Monday        Monday       Latte          15   10.0
Tuesday      Tuesday    Espresso          30   10.0
Tuesday      Tuesday       Latte          20   10.0
Wednesday  Wednesday    Espresso          35   10.0
Wednesday  Wednesday       Latte          25   10.0
Thursday    Thursday    Espresso          40    NaN
Thursday    Thursday       Latte          30    NaN
Friday        Friday    Espresso          45    NaN
Friday        Friday       Latte          35    NaN
Saturday    Saturday    Espresso          45    NaN
Saturday    Saturday       Latte          35    NaN
Sunday        Sunday    Espresso          45    NaN
Sunday        Sunday       Latte          35    NaN

In [81]:
coffee.iat[3,1]

'Latte'

In [84]:
coffee.at['Monday','Units Sold']

Day
Monday    25
Monday    15
Name: Units Sold, dtype: int64

## To sort the values

In [86]:
for i in list(coffee.columns):
    print(coffee[i].unique)
    print()

<bound method Series.unique of Day
Monday          Monday
Monday          Monday
Tuesday        Tuesday
Tuesday        Tuesday
Wednesday    Wednesday
Wednesday    Wednesday
Thursday      Thursday
Thursday      Thursday
Friday          Friday
Friday          Friday
Saturday      Saturday
Saturday      Saturday
Sunday          Sunday
Sunday          Sunday
Name: Day, dtype: object>

<bound method Series.unique of Day
Monday       Espresso
Monday          Latte
Tuesday      Espresso
Tuesday         Latte
Wednesday    Espresso
Wednesday       Latte
Thursday     Espresso
Thursday        Latte
Friday       Espresso
Friday          Latte
Saturday     Espresso
Saturday        Latte
Sunday       Espresso
Sunday          Latte
Name: Coffee Type, dtype: object>

<bound method Series.unique of Day
Monday       25
Monday       15
Tuesday      30
Tuesday      20
Wednesday    35
Wednesday    25
Thursday     40
Thursday     30
Friday       45
Friday       35
Saturday     45
Saturday     35
Sunday       45
Sunday       35
Name: Units Sold, dtype: int64>

<bound method Series.unique of Day
Monday       10.0
Monday       10.0
Tuesday      10.0
Tuesday      10.0
Wednesday    10.0
Wednesday    10.0
Thursday      NaN
Thursday      NaN
Friday        NaN
Friday        NaN
Saturday      NaN
Saturday      NaN
Sunday        NaN
Sunday        NaN
Name: units, dtype: float64>

In [89]:
coffee.sort_values(['Units Sold'])

                 Day Coffee Type  Units Sold  units
Day
Monday        Monday       Latte          15   10.0
Tuesday      Tuesday       Latte          20   10.0
Monday        Monday    Espresso          25   10.0
Wednesday  Wednesday       Latte          25   10.0
Tuesday      Tuesday    Espresso          30   10.0
Thursday    Thursday       Latte          30    NaN
Wednesday  Wednesday    Espresso          35   10.0
Friday        Friday       Latte          35    NaN
Saturday    Saturday       Latte          35    NaN
Sunday        Sunday       Latte          35    NaN
Thursday    Thursday    Espresso          40    NaN
Friday        Friday    Espresso          45    NaN
Saturday    Saturday    Espresso          45    NaN
Sunday        Sunday    Espresso          45    NaN

In [90]:
coffee.sort_index()

                 Day Coffee Type  Units Sold  units
Day
Friday        Friday    Espresso          45    NaN
Friday        Friday       Latte          35    NaN
Monday        Monday    Espresso          25   10.0
Monday        Monday       Latte          15   10.0
Saturday    Saturday    Espresso          45    NaN
Saturday    Saturday       Latte          35    NaN
Sunday        Sunday    Espresso          45    NaN
Sunday        Sunday       Latte          35    NaN
Thursday    Thursday    Espresso          40    NaN
Thursday    Thursday       Latte          30    NaN
Tuesday      Tuesday    Espresso          30   10.0
Tuesday      Tuesday       Latte          20   10.0
Wednesday  Wednesday    Espresso          35   10.0
Wednesday  Wednesday       Latte          25   10.0

In [94]:
coffee.sort_index(ascending=False)
# with respect to the length

                 Day Coffee Type  Units Sold  units
Day
Wednesday  Wednesday    Espresso          35   10.0
Wednesday  Wednesday       Latte          25   10.0
Tuesday      Tuesday    Espresso          30   10.0
Tuesday      Tuesday       Latte          20   10.0
Thursday    Thursday    Espresso          40    NaN
Thursday    Thursday       Latte          30    NaN
Sunday        Sunday    Espresso          45    NaN
Sunday        Sunday       Latte          35    NaN
Saturday    Saturday    Espresso          45    NaN
Saturday    Saturday       Latte          35    NaN
Monday        Monday    Espresso          25   10.0
Monday        Monday       Latte          15   10.0
Friday        Friday    Espresso          45    NaN
Friday        Friday       Latte          35    NaN

In [97]:
coffee.sort_values(['Units Sold','Coffee Type'],ascending=[0,1])

                 Day Coffee Type  Units Sold  units
Day
Friday        Friday    Espresso          45    NaN
Saturday    Saturday    Espresso          45    NaN
Sunday        Sunday    Espresso          45    NaN
Thursday    Thursday    Espresso          40    NaN
Wednesday  Wednesday    Espresso          35   10.0
Friday        Friday       Latte          35    NaN
Saturday    Saturday       Latte          35    NaN
Sunday        Sunday       Latte          35    NaN
Tuesday      Tuesday    Espresso          30   10.0
Thursday    Thursday       Latte          30    NaN
Monday        Monday    Espresso          25   10.0
Wednesday  Wednesday       Latte          25   10.0
Tuesday      Tuesday       Latte          20   10.0
Monday        Monday       Latte          15   10.0

In [98]:
# iterate over the dataframe

In [99]:
for i in range(coffee.shape[0]):
    print(coffee.iloc[i])

Day              Monday
Coffee Type    Espresso
Units Sold           25
units              10.0
Name: Monday, dtype: object
Day            Monday
Coffee Type     Latte
Units Sold         15
units            10.0
Name: Monday, dtype: object
Day             Tuesday
Coffee Type    Espresso
Units Sold           30
units              10.0
Name: Tuesday, dtype: object
Day            Tuesday
Coffee Type      Latte
Units Sold          20
units             10.0
Name: Tuesday, dtype: object
Day            Wednesday
Coffee Type     Espresso
Units Sold            35
units               10.0
Name: Wednesday, dtype: object
Day            Wednesday
Coffee Type        Latte
Units Sold            25
units               10.0
Name: Wednesday, dtype: object
Day            Thursday
Coffee Type    Espresso
Units Sold           40
units               NaN
Name: Thursday, dtype: object
Day            Thursday
Coffee Type       Latte
Units Sold           30
units               NaN
Name: Thursday, dtype: object
Day              Friday
Coffee Type    Espresso
Units Sold           45
units               NaN
Name: Friday, dtype: object
Day            Friday
Coffee Type     Latte
Units Sold         35
units             NaN
Name: Friday, dtype: object
Day            Saturday
Coffee Type    Espresso
Units Sold           45
units               NaN
Name: Saturday, dtype: object
Day            Saturday
Coffee Type       Latte
Units Sold           35
units               NaN
Name: Saturday, dtype: object
Day              Sunday
Coffee Type    Espresso
Units Sold           45
units               NaN
Name: Sunday, dtype: object
Day            Sunday
Coffee Type     Latte
Units Sold         35
units             NaN
Name: Sunday, dtype: object

In [101]:
coffee.tail(2)

           Day Coffee Type  Units Sold  units
Day
Sunday  Sunday    Espresso          45    NaN
Sunday  Sunday       Latte          35    NaN

In [102]:
# second method

In [104]:
for i,row in coffee.iterrows():
    print(i)
    print(row)

Monday
Day              Monday
Coffee Type    Espresso
Units Sold           25
units              10.0
Name: Monday, dtype: object
Monday
Day            Monday
Coffee Type     Latte
Units Sold         15
units            10.0
Name: Monday, dtype: object
Tuesday
Day             Tuesday
Coffee Type    Espresso
Units Sold           30
units              10.0
Name: Tuesday, dtype: object
Tuesday
Day            Tuesday
Coffee Type      Latte
Units Sold          20
units             10.0
Name: Tuesday, dtype: object
Wednesday
Day            Wednesday
Coffee Type     Espresso
Units Sold            35
units               10.0
Name: Wednesday, dtype: object
Wednesday
Day            Wednesday
Coffee Type        Latte
Units Sold            25
units               10.0
Name: Wednesday, dtype: object
Thursday
Day            Thursday
Coffee Type    Espresso
Units Sold           40
units               NaN
Name: Thursday, dtype: object
Thursday
Day            Thursday
Coffee Type       Latte
Units Sold           30
units               NaN
Name: Thursday, dtype: object
Friday
Day              Friday
Coffee Type    Espresso
Units Sold           45
units               NaN
Name: Friday, dtype: object
Friday
Day            Friday
Coffee Type     Latte
Units Sold         35
units             NaN
Name: Friday, dtype: object
Saturday
Day            Saturday
Coffee Type    Espresso
Units Sold           45
units               NaN
Name: Saturday, dtype: object
Saturday
Day            Saturday
Coffee Type       Latte
Units Sold           35
units               NaN
Name: Saturday, dtype: object
Sunday
Day              Sunday
Coffee Type    Espresso
Units Sold           45
units               NaN
Name: Sunday, dtype: object
Sunday
Day            Sunday
Coffee Type     Latte
Units Sold         35
units             NaN
Name: Sunday, dtype: object

In [105]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [106]:
bios.tail()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20

In [107]:
bios

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25
...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20

In [108]:
bios.loc[0]

athlete_id                          1
name            Jean-François Blanchy
born_date                  1886-12-12
born_city                    Bordeaux
born_region                   Gironde
born_country                      FRA
NOC                            France
height_cm                         NaN
weight_kg                         NaN
died_date                  1960-10-02
Name: 0, dtype: object

In [109]:
bios['height_cm']>165

0         False
1          True
2          True
3          True
4         False
          ...
145495     True
145496     True
145497    False
145498     True
145499    False
Name: height_cm, Length: 145500, dtype: bool

In [110]:
bios[bios['height_cm']>200]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
1080,1087,Bozhil Lozanov,1934-08-16,NaN,NaN,NaN,Bulgaria,208.0,133.0,NaN
1673,1680,Alexis Rubalcaba,1972-08-09,Pedro Betancourt,Matanzas,CUB,Cuba,204.0,95.0,NaN
2647,2659,Milan Šrejber,1963-12-30,Praha (Prague),Hlavní město Praha,CZE,Czechoslovakia,203.0,98.0,NaN
2827,2839,Nik'oloz Deriugini,1959-04-30,Kutaisi,Imereti,GEO,Soviet Union,206.0,105.0,NaN
2832,2844,Elşad Qadaşev,1968-05-01,Bakı,Bakı,AZE,Unified Team,205.0,110.0,NaN
...,...,...,...,...,...,...,...,...,...,...
143784,147440,Daniel Miklasevich,1997-07-17,NaN,NaN,NaN,United States,203.0,NaN,NaN
143833,147489,Garrett Muagututia,1988-02-26,NaN,NaN,NaN,United States,205.0,NaN,NaN
143834,147490,Kyle Ensing,1997-03-06,NaN,NaN,NaN,United States,201.0,NaN,NaN
143835,147491,Mitch Stahl,1994-08-31,NaN,NaN,NaN,United States,203.0,NaN,NaN
143919,147577,Emerson Rodríguez,1993-02-02,Caracas,Distrito Capital,VEN,Venezuela,204.0,NaN,NaN

In [111]:
bios.loc[bios['height_cm']>165]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
5,6,Nicolas Chatelain,1970-01-13,Amiens,Somme,FRA,France,181.0,70.0,NaN
6,7,Patrick Chila,1969-11-27,Ris-Orangis,Essonne,FRA,France,180.0,73.0,NaN
...,...,...,...,...,...,...,...,...,...,...
145473,149200,Toms Andersons,1993-11-25,Rīga,Rīga,LAT,Latvia,185.0,86.0,NaN
145494,149221,George Wright,1890-07-21,Toronto,Ontario,CAN,Canada,183.0,NaN,1973-01-28
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18

In [113]:
bios.loc[bios['height_cm']>164,['name','born_date']]

                       name   born_date
1            Arnaud Boetsch  1969-04-01
2              Jean Borotra  1898-08-13
3           Jacques Brugnon  1895-05-11
5         Nicolas Chatelain  1970-01-13
6             Patrick Chila  1969-11-27
...                     ...         ...
145473       Toms Andersons  1993-11-25
145494        George Wright  1890-07-21
145495    Polina Luchnikova  2002-01-30
145496  Valeriya Merkusheva  1999-09-20
145498       André Foussard  1899-05-19

[93622 rows x 2 columns]

In [114]:
# bios.loc method was used to select the columns to be displayed

In [121]:
bios[(bios['height_cm']>215 )& (bios['born_country']=='USA')]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
5781,5804,Tommy Burleson,1952-02-24,Crossnore,North Carolina,USA,United States,223.0,102.0,NaN
6722,6755,Shaquille O'Neal,1972-03-06,Newark,New Jersey,USA,United States,216.0,137.0,NaN
6937,6972,David Robinson,1965-08-06,Key West,Florida,USA,United States,216.0,107.0,NaN
123850,126093,Tyson Chandler,1982-10-02,Hanford,California,USA,United States,216.0,107.0,NaN

## Filtering out the conditions using string matching

In [125]:
bios[bios['name'].str.contains('keith',case=False)]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
1897,1907,Keith Hanlon,1966-09-01,NaN,NaN,NaN,Ireland,NaN,NaN,NaN
3505,3517,Keith Wallace,1961-03-29,Preston,England,GBR,Great Britain,165.0,51.0,1999-12-31
6228,6255,Keith Hartley,1940-10-15,Vancouver,British Columbia,CAN,Canada,200.0,85.0,NaN
8898,8946,Keith Mwila,1966-01-01,NaN,NaN,NaN,Zambia,NaN,NaN,1993-01-09
12053,12118,Keith Hervey,1898-11-03,Fulham,England,GBR,Great Britain,NaN,NaN,1973-02-22
...,...,...,...,...,...,...,...,...,...,...
109900,111105,Keith Cumberpatch,1927-08-25,Christchurch,Canterbury,NZL,New Zealand,NaN,NaN,2013-11-15
115973,117348,Keith Sanderson,1975-02-02,Plymouth,Massachusetts,USA,United States,183.0,95.0,NaN
117676,119195,Duncan Keith,1983-07-16,Winnipeg,Manitoba,CAN,Canada,185.0,88.0,NaN
122121,124176,Keith Ferguson,1979-09-07,Sale,Victoria,AUS,Australia,176.0,78.0,NaN
127310,129749,Tracy Keith-Matchitt,1990-03-30,Palmerston North,Manawatu-Wanganui,NZL,Cook Islands,167.0,60.0,NaN

In [126]:
bios[bios['name'].str.contains('Adi',case=False)]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
210,211,Ilona Váradi,1891-08-04,Budapest,Budapest,HUN,Hungary,NaN,NaN,1945-02-19
260,261,Suharyadi,1965-02-14,Blora,Jawa Tengah,INA,Indonesia,170.0,60.0,NaN
281,282,S. M. Hadi,1899-08-12,Hyderabad,Andhra Pradesh,IND,India,NaN,NaN,1971-07-14
368,369,Sylvain Cadieux,1974-09-25,Saint-Louis-de-Terrebonne,Québec,CAN,Canada,182.0,77.0,NaN
604,606,Nadia Bisiach,1965-01-25,NaN,NaN,NaN,Australia,163.0,60.0,NaN
...,...,...,...,...,...,...,...,...,...,...
144863,148568,Vladislav Kireyev,2000-09-24,NaN,NaN,NaN,Kazakhstan,NaN,NaN,NaN
144877,148582,Adil Galiakhmetov,1998-11-16,Oral,Batys Qazaqstan,KAZ,Kazakhstan,NaN,NaN,NaN
145463,149190,Vladimir Tkachyov,1993-10-05,Dnipro,Dnipropetrovsk,UKR,ROC,183.0,84.0,NaN
145474,149201,Nadine Hofstetter,1994-10-21,Romoos,Luzern,SUI,Switzerland,164.0,68.0,NaN
145481,149208,Vladislav Zharovtsev,1996-05-01,Minusinsk,Krasnoyarsk Kray,RUS,ROC,NaN,NaN,NaN

In [128]:
bios.sort_values(['name'],ascending=False)

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
99727,100526,Аlex Halcheniuk,1967-07-28,Minsk,Minsk,BLR,Belarus,181.0,87.0,NaN
80057,80708,Ștefania Botcariu,1936-01-11,Bistrița,Bistrița-Năsăud,ROU,Romania,NaN,NaN,NaN
32372,32615,Ștefan Zoller,1914-08-27,Sibiu,Sibiu,ROU,Romania,NaN,NaN,1993-10-21
104214,105226,Ștefan Vasile,1982-02-17,Brăila,Brăila,ROU,Romania,188.0,87.0,NaN
104603,105625,Ștefan Vasilache,1979-05-09,Roman,Neamț,ROU,Romania,191.0,79.0,NaN
...,...,...,...,...,...,...,...,...,...,...
23976,24163,Abel Braga,1952-09-01,Rio de Janeiro,Rio de Janeiro,BRA,Brazil,190.0,73.0,NaN
113784,115084,Abdul Rashid,1979-02-15,Khanewal,Punjab,PAK,Pakistan,184.0,70.0,NaN
19821,19960,Abdul Rashid,1922-06-01,Rawalpindi,Punjab,PAK,Pakistan,169.0,91.0,1988-03-08
73853,74423,Abdul Rashid,1928-04-25,NaN,NaN,NaN,Pakistan,NaN,NaN,NaN
19822,19961,Abdul Rashid,1947-03-03,Bannu,Khyber-Pukhtunkhwa,PAK,Pakistan,170.0,75.0,2020-11-04

In [129]:
# more funcions

In [133]:
bios.loc[bios['name'].str.contains('adi|keith',case=False),['name','born_date']]

                        name   born_date
210             Ilona Váradi  1891-08-04
260                Suharyadi  1965-02-14
281               S. M. Hadi  1899-08-12
368          Sylvain Cadieux  1974-09-25
604            Nadia Bisiach  1965-01-25
...                      ...         ...
144863     Vladislav Kireyev  2000-09-24
144877     Adil Galiakhmetov  1998-11-16
145463     Vladimir Tkachyov  1993-10-05
145474     Nadine Hofstetter  1994-10-21
145481  Vladislav Zharovtsev  1996-05-01

[1309 rows x 2 columns]

In [131]:
# we can use the regex in the pandas.str.contains() method

In [134]:
bios.loc[(bios['born_country'].isin(['USA','FRA','GBR'])) & (bios['name'].str.contains('adi',case=False))]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
9535,9589,Franck Adisson,1969-07-24,Tarbes,Hautes-Pyrénées,FRA,France,180.0,70.0,NaN
13204,13284,René Abadie,1935-08-13,Labroquère,Haute-Garonne,FRA,France,NaN,NaN,1996-07-11
15318,15423,Marc Madiot,1959-04-16,Renazé,Mayenne,FRA,France,179.0,74.0,NaN
17743,17864,Vladimir Aïtoff,1879-08-05,Paris VIe,Paris,FRA,France,NaN,NaN,1963-09-06
20696,20843,Nadia Boudesoque,1918-04-11,Montcornet,Aisne,FRA,Mexico,NaN,NaN,2014-01-17
24881,25070,Sadi Dastarac,1888-06-14,Saint-Vincent-de-Paul,Landes,FRA,France,NaN,NaN,1911-02-02
28189,28399,Nadia Mimoun,1978-12-28,Montpellier,Hérault,FRA,France,160.0,44.0,NaN
29643,29868,Raymond Badin,1928-03-19,Mâcon,Saône-et-Loire,FRA,France,164.0,NaN,2000-03-01
36752,37046,Bernard Meynadier,1938-04-19,Saint-Germain-en-Laye,Yvelines,FRA,France,186.0,83.0,NaN
41762,42082,Franck Badiou,1967-03-24,Vitry-sur-Seine,Val-de-Marne,FRA,France,174.0,68.0,NaN
46364,46711,Nadine Delache,1941-02-07,Rouvray,Pas-de-Calais,FRA,France,162.0,52.0,NaN
46523,46871,Vladimir Latocha,1973-08-15,Paris,Paris,FRA,France,195.0,99.0,NaN
50746,51105,Helene Madison,1913-06-19,Madison,Wisconsin,USA,United States,NaN,NaN,1970-11-25
55247,55642,Ernest Cadine,1893-07-12,Saint-Denis,Seine-Saint-Denis,FRA,France,167.0,82.0,1978-05-20
67385,67896,Nadine Auzeil-Schoellkopf,1964-08-19,Barr,Bas-Rhin,FRA,France,176.0,60.0,NaN
67398,67909,Christiane Cadic,1947-01-08,Le Trait,Seine-Maritime,FRA,France,164.0,60.0,NaN
67414,67925,Nadine Debois,1961-09-25,Paris,Paris,FRA,France,173.0,63.0,NaN
67489,68000,Nadine Prévost,1951-05-07,Sézanne,Marne,FRA,France,167.0,60.0,NaN
67490,68001,Marguerite Radideau,1907-03-05,Paris VIe,Paris,FRA,France,NaN,NaN,1978-03-14
67559,68070,Nadia Prasad,1967-10-06,Caussade,Tarn-et-Garonne,FRA,France,158.0,44.0,NaN
67947,68462,Vladimir Prikhodko,1944-03-01,Paris XVe,Paris,FRA,France,189.0,102.0,2011-11-27
67956,68471,Pierre Ramadier,1902-05-22,Lunel,Hérault,FRA,France,171.0,69.0,1983-06-11
78283,78874,Doug Padilla,1956-10-04,Oakland,California,USA,United States,176.0,60.0,NaN
86186,86873,Linda Ferga-Khodadin,1976-12-24,Paris,Paris,FRA,France,169.0,60.0,NaN
95434,96204,Bob Paradise,1944-04-22,Saint Paul,Minnesota,USA,United States,176.0,80.0,NaN
99392,100191,Stéphane Bernadis,1974-02-23,Boulogne-Billancourt,Hauts-de-Seine,FRA,France,180.0,80.0,NaN
101090,101958,Ioannis Leivaditis,1974-01-29,Chicago,Illinois,USA,Greece,NaN,NaN,NaN
101772,102701,Mamadi Berthe,1983-01-17,Nogent-sur-Marne,Val-de-Marne,FRA,Mali,180.0,78.0,NaN
104416,105435,Hafida Gadi-Richard,1974-07-14,Saint-Étienne,Loire,FRA,France,164.0,47.0,NaN
105703,106759,Rhadi Ferguson,1973-04-03,Rockville,Maryland,USA,United States,175.0,99.0,NaN
115696,117062,Mike Zadick,1976-07-12,Great Falls,Montana,USA,United States,165.0,69.0,NaN
120134,121996,Seun Adigun,1987-01-03,Algonquin,Illinois,USA,Nigeria,165.0,70.0,NaN
124240,126527,Tianna Madison-Bartoletta,1985-08-30,Elyria,Ohio,USA,United States,168.0,58.0,NaN
126336,128687,Sadie Bjornsen,1989-11-21,Omak,Washington,USA,United States,175.0,66.0,NaN
126366,128718,Madison Chock,1992-07-02,Redondo Beach,California,USA,United States,157.0,49.0,NaN
127662,130129,Kadidiatou Diani,1995-04-01,Ivry-sur-Seine,Val-de-Marne,FRA,France,168.0,64.0,NaN
129485,132103,Madison Kocian,1997-06-15,Dallas,Texas,USA,United States,157.0,46.0,NaN
129548,132167,Madison Keys,1995-02-17,Rock Island,Illinois,USA,United States,178.0,68.0,NaN
133382,136321,Madison Hughes,1992-10-26,Epsom,England,GBR,United States,173.0,80.0,NaN
135146,138289,Madison Olsen,1995-04-07,Salt Lake City,Utah,USA,United States,170.0,61.0,NaN
135159,138302,Madison Hubbell,1991-02-24,Lansing,Michigan,USA,United States,173.0,68.0,NaN
135161,138304,Bradie Tennell,1998-01-31,Winfield,Illinois,USA,United States,168.0,55.0,NaN
135600,138814,Lexie Madigan,2002-02-12,Sacramento,California,USA,United States,NaN,NaN,NaN

## Query Functions

In [135]:
bios.query("born_country=='USA' and born_city=='Seattle'")

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
11030,11088,David Halpern,1955-08-18,Seattle,Washington,USA,United States,178.0,79.0,NaN
12800,12870,Todd Trewin,1958-04-20,Seattle,Washington,USA,United States,180.0,75.0,NaN
15476,15583,Scott McKinley,1968-10-15,Seattle,Washington,USA,United States,183.0,75.0,NaN
29079,29293,Joyce Tanac,1950-09-27,Seattle,Washington,USA,United States,156.0,49.0,NaN
31135,31371,Bill Kuhlemeier,1908-01-14,Seattle,Washington,USA,United States,NaN,NaN,2001-07-08
...,...,...,...,...,...,...,...,...,...,...
133392,136331,Hans Struzyna,1989-03-31,Seattle,Washington,USA,United States,188.0,91.0,NaN
135448,138662,Maude Davis Crossland,2003-03-19,Seattle,Washington,USA,Colombia,NaN,NaN,NaN
136993,140229,Jenell Berhorst,2003-12-13,Seattle,Washington,USA,United States,NaN,NaN,NaN
143507,147159,Nevin Harrison,2002-06-02,Seattle,Washington,USA,United States,175.0,73.0,NaN
145446,149169,Corinne Stoddard,2001-08-15,Seattle,Washington,USA,United States,NaN,NaN,NaN

In [136]:
coffee.head()

                 Day Coffee Type  Units Sold  units
Day
Monday        Monday    Espresso          25   10.0
Monday        Monday       Latte          15   10.0
Tuesday      Tuesday    Espresso          30   10.0
Tuesday      Tuesday       Latte          20   10.0
Wednesday  Wednesday    Espresso          35   10.0

In [137]:
coffee.head(10)

                 Day Coffee Type  Units Sold  units
Day
Monday        Monday    Espresso          25   10.0
Monday        Monday       Latte          15   10.0
Tuesday      Tuesday    Espresso          30   10.0
Tuesday      Tuesday       Latte          20   10.0
Wednesday  Wednesday    Espresso          35   10.0
Wednesday  Wednesday       Latte          25   10.0
Thursday    Thursday    Espresso          40    NaN
Thursday    Thursday       Latte          30    NaN
Friday        Friday    Espresso          45    NaN
Friday        Friday       Latte          35    NaN

In [138]:
coffee

                 Day Coffee Type  Units Sold  units
Day
Monday        Monday    Espresso          25   10.0
Monday        Monday       Latte          15   10.0
Tuesday      Tuesday    Espresso          30   10.0
Tuesday      Tuesday       Latte          20   10.0
Wednesday  Wednesday    Espresso          35   10.0
Wednesday  Wednesday       Latte          25   10.0
Thursday    Thursday    Espresso          40    NaN
Thursday    Thursday       Latte          30    NaN
Friday        Friday    Espresso          45    NaN
Friday        Friday       Latte          35    NaN
Saturday    Saturday    Espresso          45    NaN
Saturday    Saturday       Latte          35    NaN
Sunday        Sunday    Espresso          45    NaN
Sunday        Sunday       Latte          35    NaN

### Adding the new column

In [139]:
coffee['price']=5.99

In [140]:
coffee

                 Day Coffee Type  Units Sold  units  price
Day
Monday        Monday    Espresso          25   10.0   5.99
Monday        Monday       Latte          15   10.0   5.99
Tuesday      Tuesday    Espresso          30   10.0   5.99
Tuesday      Tuesday       Latte          20   10.0   5.99
Wednesday  Wednesday    Espresso          35   10.0   5.99
Wednesday  Wednesday       Latte          25   10.0   5.99
Thursday    Thursday    Espresso          40    NaN   5.99
Thursday    Thursday       Latte          30    NaN   5.99
Friday        Friday    Espresso          45    NaN   5.99
Friday        Friday       Latte          35    NaN   5.99
Saturday    Saturday    Espresso          45    NaN   5.99
Saturday    Saturday       Latte          35    NaN   5.99
Sunday        Sunday    Espresso          45    NaN   5.99
Sunday        Sunday       Latte          35    NaN   5.99

In [141]:
coffee['price']

Day
Monday       5.99
Monday       5.99
Tuesday      5.99
Tuesday      5.99
Wednesday    5.99
Wednesday    5.99
Thursday     5.99
Thursday     5.99
Friday       5.99
Friday       5.99
Saturday     5.99
Saturday     5.99
Sunday       5.99
Sunday       5.99
Name: price, dtype: float64

In [142]:
type(coffee['price'])

pandas.core.series.Series

In [143]:
## to modify the dataframes in different form

In [144]:
coffee

                 Day Coffee Type  Units Sold  units  price
Day
Monday        Monday    Espresso          25   10.0   5.99
Monday        Monday       Latte          15   10.0   5.99
Tuesday      Tuesday    Espresso          30   10.0   5.99
Tuesday      Tuesday       Latte          20   10.0   5.99
Wednesday  Wednesday    Espresso          35   10.0   5.99
Wednesday  Wednesday       Latte          25   10.0   5.99
Thursday    Thursday    Espresso          40    NaN   5.99
Thursday    Thursday       Latte          30    NaN   5.99
Friday        Friday    Espresso          45    NaN   5.99
Friday        Friday       Latte          35    NaN   5.99
Saturday    Saturday    Espresso          45    NaN   5.99
Saturday    Saturday       Latte          35    NaN   5.99
Sunday        Sunday    Espresso          45    NaN   5.99
Sunday        Sunday       Latte          35    NaN   5.99

In [145]:
coffee['new price']=np.where(coffee['Coffee Type']=='Espresso',3.99,5.99)

In [146]:
coffee

                 Day Coffee Type  Units Sold  units  price  new price
Day
Monday        Monday    Espresso          25   10.0   5.99       3.99
Monday        Monday       Latte          15   10.0   5.99       5.99
Tuesday      Tuesday    Espresso          30   10.0   5.99       3.99
Tuesday      Tuesday       Latte          20   10.0   5.99       5.99
Wednesday  Wednesday    Espresso          35   10.0   5.99       3.99
Wednesday  Wednesday       Latte          25   10.0   5.99       5.99
Thursday    Thursday    Espresso          40    NaN   5.99       3.99
Thursday    Thursday       Latte          30    NaN   5.99       5.99
Friday        Friday    Espresso          45    NaN   5.99       3.99
Friday        Friday       Latte          35    NaN   5.99       5.99
Saturday    Saturday    Espresso          45    NaN   5.99       3.99
Saturday    Saturday       Latte          35    NaN   5.99       5.99
Sunday        Sunday    Espresso          45    NaN   5.99       3.99
Sunday        Sunday       Latte          35    NaN   5.99       5.99

In [147]:
coffee.drop(columns=['new price'],inplace=True)

In [148]:
coffee

                 Day Coffee Type  Units Sold  units  price
Day
Monday        Monday    Espresso          25   10.0   5.99
Monday        Monday       Latte          15   10.0   5.99
Tuesday      Tuesday    Espresso          30   10.0   5.99
Tuesday      Tuesday       Latte          20   10.0   5.99
Wednesday  Wednesday    Espresso          35   10.0   5.99
Wednesday  Wednesday       Latte          25   10.0   5.99
Thursday    Thursday    Espresso          40    NaN   5.99
Thursday    Thursday       Latte          30    NaN   5.99
Friday        Friday    Espresso          45    NaN   5.99
Friday        Friday       Latte          35    NaN   5.99
Saturday    Saturday    Espresso          45    NaN   5.99
Saturday    Saturday       Latte          35    NaN   5.99
Sunday        Sunday    Espresso          45    NaN   5.99
Sunday        Sunday       Latte          35    NaN   5.99

In [149]:
coffee['revenue']=coffee['price']*coffee['Units Sold']

In [150]:
coffee

                 Day Coffee Type  Units Sold  units  price  revenue
Day
Monday        Monday    Espresso          25   10.0   5.99   149.75
Monday        Monday       Latte          15   10.0   5.99    89.85
Tuesday      Tuesday    Espresso          30   10.0   5.99   179.70
Tuesday      Tuesday       Latte          20   10.0   5.99   119.80
Wednesday  Wednesday    Espresso          35   10.0   5.99   209.65
Wednesday  Wednesday       Latte          25   10.0   5.99   149.75
Thursday    Thursday    Espresso          40    NaN   5.99   239.60
Thursday    Thursday       Latte          30    NaN   5.99   179.70
Friday        Friday    Espresso          45    NaN   5.99   269.55
Friday        Friday       Latte          35    NaN   5.99   209.65
Saturday    Saturday    Espresso          45    NaN   5.99   269.55
Saturday    Saturday       Latte          35    NaN   5.99   209.65
Sunday        Sunday    Espresso          45    NaN   5.99   269.55
Sunday        Sunday       Latte          35    NaN   5.99   209.65

In [151]:
coffee.rename(columns={'price':'newprice'})

                 Day Coffee Type  Units Sold  units  newprice  revenue
Day
Monday        Monday    Espresso          25   10.0      5.99   149.75
Monday        Monday       Latte          15   10.0      5.99    89.85
Tuesday      Tuesday    Espresso          30   10.0      5.99   179.70
Tuesday      Tuesday       Latte          20   10.0      5.99   119.80
Wednesday  Wednesday    Espresso          35   10.0      5.99   209.65
Wednesday  Wednesday       Latte          25   10.0      5.99   149.75
Thursday    Thursday    Espresso          40    NaN      5.99   239.60
Thursday    Thursday       Latte          30    NaN      5.99   179.70
Friday        Friday    Espresso          45    NaN      5.99   269.55
Friday        Friday       Latte          35    NaN      5.99   209.65
Saturday    Saturday    Espresso          45    NaN      5.99   269.55
Saturday    Saturday       Latte          35    NaN      5.99   209.65
Sunday        Sunday    Espresso          45    NaN      5.99   269.55
Sunday        Sunday       Latte          35    NaN      5.99   209.65

In [152]:
bios

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25
...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20

In [163]:
bios['firstname']=(bios['name'].str.split(' ').str[0])

In [164]:
bios

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,firstname
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-François
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert
...,...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN,Polina
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN,Valeriya
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN,Yuliya
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18,André
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,Bill

In [167]:
bios.query("firstname=='Keith'")

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,firstname
1897,1907,Keith Hanlon,1966-09-01,NaN,NaN,NaN,Ireland,NaN,NaN,NaN,Keith
3505,3517,Keith Wallace,1961-03-29,Preston,England,GBR,Great Britain,165.0,51.0,1999-12-31,Keith
6228,6255,Keith Hartley,1940-10-15,Vancouver,British Columbia,CAN,Canada,200.0,85.0,NaN,Keith
8898,8946,Keith Mwila,1966-01-01,NaN,NaN,NaN,Zambia,NaN,NaN,1993-01-09,Keith
12053,12118,Keith Hervey,1898-11-03,Fulham,England,GBR,Great Britain,NaN,NaN,1973-02-22,Keith
...,...,...,...,...,...,...,...,...,...,...,...
99921,100722,Keith Carney,1970-02-03,Providence,Rhode Island,USA,United States,188.0,93.0,NaN,Keith
102227,103168,Keith Beavers,1983-02-09,London,Ontario,CAN,Canada,185.0,75.0,NaN,Keith
109900,111105,Keith Cumberpatch,1927-08-25,Christchurch,Canterbury,NZL,New Zealand,NaN,NaN,2013-11-15,Keith
115973,117348,Keith Sanderson,1975-02-02,Plymouth,Massachusetts,USA,United States,183.0,95.0,NaN,Keith
122121,124176,Keith Ferguson,1979-09-07,Sale,Victoria,AUS,Australia,176.0,78.0,NaN,Keith

In [168]:
bios.to_csv('/Users/chowdaryadithyasaividivada/Documents/Pandas/bioscsv.csv')